[
  {"ideologyLabel": "Transcendental Idealism", "description": "<p>Transcendental Idealism is Immanuel Kant's revolutionary philosophical framework that fundamentally changed how we understand the relationship between mind and reality. Developed in his Critique of Pure Reason (1781), it argues that while we can never know things as they are in themselves (noumena), we can only know how things appear to us through the structures of our mind (phenomena).</p><p>Kant proposed that space and time are not features of the world itself, but rather forms of our sensibility—the way our minds necessarily structure all experience. Similarly, categories like causality, substance, and unity are concepts of our understanding that we impose on experience. This doesn't mean reality is an illusion, but rather that our knowledge is limited to how things appear within these necessary structures.</p><p>This 'Copernican Revolution' in philosophy reconciled rationalism and empiricism, showing how synthetic a priori knowledge is possible—knowledge that is both necessarily true and informative about the world.</p>", "category": "idealism", "philosopher": "Immanuel Kant (1724-1804)", "relatedLabel": "Noumena", "relatedDescription": "Reality as it exists independently of our perception or conceptualization—the 'thing-in-itself.' Kant argued we can never directly know noumena, only their appearances (phenomena) filtered through our mental structures.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Transcendental Idealism", "category": "idealism", "relatedLabel": "Phenomena", "relatedDescription": "The world as it appears to us through our senses and mental structures. Phenomena are shaped by our forms of intuition (space and time) and categories of understanding, making them knowable but not representing reality as it is in itself.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Transcendental Idealism", "category": "idealism", "relatedLabel": "Categories", "relatedDescription": "Fundamental concepts (like causality, substance, unity) that the mind applies to organize sensory experience. These are a priori structures—not learned from experience but necessary conditions for having any coherent experience at all.", "relatedCategory": "epistemology", "relation": "partOf"},
  {"ideologyLabel": "Transcendental Idealism", "category": "idealism", "relatedLabel": "Synthetic A Priori", "relatedDescription": "Knowledge that is both necessarily true (a priori) and informative about the world (synthetic), such as mathematical truths and basic principles of science. Kant's great insight was showing how such knowledge is possible through the mind's structuring of experience.", "relatedCategory": "epistemology", "relation": "partOf"},
  {"ideologyLabel": "Transcendental Idealism", "category": "idealism", "relatedLabel": "Copernican Revolution", "relatedDescription": "Kant's reversal of the traditional relationship between mind and world. Just as Copernicus showed Earth revolves around the sun (not vice versa), Kant showed objects must conform to our knowledge rather than knowledge conforming to objects.", "relatedCategory": "method", "relation": "partOf"},
  {"ideologyLabel": "Transcendental Idealism", "category": "idealism", "relatedLabel": "Empiricism", "relatedCategory": "epistemology", "relation": "critiques"},
  {"ideologyLabel": "Absolute Idealism", "description": "<p>Absolute Idealism is G.W.F. Hegel's grand philosophical system that views all of reality as the self-realization of an absolute mind or spirit (Geist). Unlike Kant's transcendental idealism which maintained a distinction between phenomena and noumena, Hegel argues that reality itself is fundamentally rational and mind-like.</p><p>Central to Absolute Idealism is the dialectical method: reality progresses through contradictions, where a thesis generates its opposite (antithesis), and these are reconciled in a higher synthesis. This isn't just a logical process but the actual structure of reality itself, from nature to history to human consciousness.</p><p>Hegel's Phenomenology of Spirit traces consciousness's journey from simple sense-certainty through self-consciousness (including the famous Master-Slave dialectic) to absolute knowledge. History itself is the manifestation of Spirit becoming self-aware through human culture and institutions.</p>", "category": "idealism", "philosopher": "G.W.F. Hegel (1770-1831)", "relatedLabel": "Dialectic", "relatedDescription": "Hegel's method of philosophical reasoning where a thesis generates its opposite (antithesis), and both are overcome and preserved in a higher synthesis. This process drives the development of reality, thought, and history.", "relatedCategory": "method", "relation": "partOf"},
  {"ideologyLabel": "Absolute Idealism", "category": "idealism", "relatedLabel": "Spirit", "relatedDescription": "Geist, the ultimate reality in Hegel's system—absolute mind or consciousness that manifests itself in nature, human history, and individual consciousness. Reality is Spirit coming to know itself.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Absolute Idealism", "category": "idealism", "relatedLabel": "World-Spirit", "relatedDescription": "Weltgeist, the universal consciousness that realizes itself through human history and culture. Different civilizations and historical epochs represent stages in the World-Spirit's self-development and self-knowledge.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Absolute Idealism", "category": "idealism", "relatedLabel": "Master-Slave Dialectic", "relatedDescription": "Hegel's famous analysis of how self-consciousness develops through mutual recognition. The master depends on the slave's recognition, while the slave achieves self-consciousness through work, revealing the interdependence and eventual reversal of their positions.", "relatedCategory": "social", "relation": "partOf"},
  {"ideologyLabel": "Absolute Idealism", "category": "idealism", "relatedLabel": "Transcendental Idealism", "relatedCategory": "idealism", "relation": "influencedBy"},
  {"ideologyLabel": "Subjective Idealism", "description": "<p>Subjective Idealism, most famously articulated by George Berkeley, holds that physical objects do not exist independently of being perceived. His principle 'esse est percipi' (to be is to be perceived) argues that material objects are nothing more than collections of ideas or sensations in minds.</p><p>Berkeley argued against materialism by questioning what we can actually know about matter beyond our perceptions of it. Since we only ever experience our own ideas, and never matter itself, the concept of matter existing independently of perception is unnecessary and meaningless. What we call the physical world is actually a consistent set of ideas produced in our minds by God.</p><p>This leads to immaterialism—the denial that matter exists at all. God acts as the permanent perceiver who maintains the existence of all things when finite minds aren't perceiving them, solving the problem of how objects continue to exist when unobserved.</p>", "category": "idealism", "philosopher": "George Berkeley (1685-1753)", "relatedLabel": "Immaterialism", "relatedDescription": "Berkeley's radical denial that matter exists at all. Only minds and ideas are real—what we call 'material objects' are collections of ideas in minds. Physical reality is mental reality.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Subjective Idealism", "category": "idealism", "relatedLabel": "Esse est Percipi", "relatedDescription": "'To be is to be perceived'—Berkeley's principle that the existence of things consists entirely in their being perceived. An object exists only when a mind perceives it; unperceived objects don't exist.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Subjective Idealism", "category": "idealism", "relatedLabel": "Divine Perception", "relatedDescription": "God's continuous perception of all things ensures their continued existence even when no finite mind perceives them. This solves the problem of how objects persist when unobserved by humans.", "relatedCategory": "theology", "relation": "partOf"},
  {"ideologyLabel": "Subjective Idealism", "category": "idealism", "relatedLabel": "Immaterialism", "relatedDescription": "Berkeley's radical position that matter doesn't exist at all—only minds and ideas exist. What we call 'material objects' are actually stable patterns of ideas in God's mind that He causes us to perceive.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Subjective Idealism", "category": "idealism", "relatedLabel": "Materialism", "relatedCategory": "metaphysics", "relation": "opposes"},
  {"ideologyLabel": "Platonic Idealism", "description": "<p>Platonic Idealism, founded by Plato (428-348 BCE), posits that abstract Forms or Ideas constitute the most fundamental reality. The physical world we perceive through our senses is merely an imperfect shadow or imitation of these eternal, unchanging Forms that exist in a separate realm.</p><p>The Theory of Forms addresses the problem of universals: when we recognize multiple things as 'beautiful' or 'just,' we're recognizing their participation in the eternal Form of Beauty or Justice. These Forms are perfect, eternal, and knowable only through reason, not sense experience.</p><p>Plato's Cave Allegory illustrates this: prisoners seeing only shadows on a wall mistake them for reality, just as we mistake the physical world for ultimate reality. True knowledge (episteme) comes from grasping the Forms through philosophical reasoning, while opinion (doxa) deals with the changing physical world. The Form of the Good stands above all others as the source of truth and being.</p>", "category": "idealism", "philosopher": "Plato (428-348 BCE)", "relatedLabel": "Theory of Forms", "relatedDescription": "Plato's doctrine that abstract, perfect, eternal Forms are the true reality, while physical objects are imperfect copies. The Form of Beauty itself is perfect and unchanging, while beautiful things in the world come and go.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Platonic Idealism", "category": "idealism", "relatedLabel": "Cave Allegory", "relatedDescription": "Plato's famous metaphor from the Republic: prisoners chained in a cave see only shadows on a wall, mistaking them for reality. The philosopher who escapes sees the true Forms outside and must return to educate others.", "relatedCategory": "allegory", "relation": "partOf"},
  {"ideologyLabel": "Platonic Idealism", "category": "idealism", "relatedLabel": "Divided Line", "relatedDescription": "Plato's diagram showing four levels of cognition, from mere imaging (eikasia) through belief (pistis) and thought (dianoia) to pure understanding (noesis) of the Forms. Higher levels grasp more real and permanent objects.", "relatedCategory": "epistemology", "relation": "partOf"},
  {"ideologyLabel": "Platonic Idealism", "category": "idealism", "relatedLabel": "Anamnesis", "relatedDescription": "Recollection—Plato's theory that learning is actually remembering what the soul knew before birth when it had direct access to the Forms. The Socratic method helps the soul 'remember' these eternal truths.", "relatedCategory": "epistemology", "relation": "partOf"},
  {"ideologyLabel": "Platonic Idealism", "category": "idealism", "relatedLabel": "Demiurge", "relatedDescription": "The divine craftsman in Plato's Timaeus who shapes the physical world by looking at the eternal Forms as templates. Not the ultimate reality (which is the Form of the Good) but a creative intermediary.", "relatedCategory": "cosmology", "relation": "partOf"},
  {"ideologyLabel": "Platonic Idealism", "category": "idealism", "relatedLabel": "Philosopher-Kings", "relatedDescription": "Plato's ideal rulers in the Republic who have knowledge of the Forms, especially the Form of the Good. Only those who understand true reality should govern, as they can make just and wise decisions.", "relatedCategory": "politics", "relation": "partOf"},
  {"ideologyLabel": "Existentialism", "description": "<p>Existentialism is a philosophical movement emphasizing individual existence, freedom, and choice. Emerging in the 19th and 20th centuries, it fundamentally challenges traditional philosophy's focus on abstract essences, insisting instead that 'existence precedes essence'—we exist first, then create our own meaning.</p><p>Key existentialist thinkers like Kierkegaard, Nietzsche, Heidegger, Sartre, and Camus explored themes of anxiety (angst), absurdity, authenticity, and radical freedom. Sartre famously declared that we are 'condemned to be free'—there's no predetermined human nature or divine plan, leaving us with the burden and responsibility of creating ourselves through our choices.</p><p>Existentialism distinguishes between authentic existence (living according to one's own values) and bad faith (denying one's freedom and responsibility). The recognition of life's absurdity—that we seek meaning in a fundamentally meaningless universe—is central to existentialist thought.</p>", "category": "existentialism", "philosopher": "Jean-Paul Sartre (1905-1980), Søren Kierkegaard, Albert Camus", "relatedLabel": "Authenticity", "relatedDescription": "Living genuinely according to one's own freely chosen values and projects rather than conforming to external expectations or social roles. Authentic existence requires acknowledgment of one's freedom and responsibility.", "relatedCategory": "ethics", "relation": "partOf"},
  {"ideologyLabel": "Existentialism", "category": "existentialism", "relatedLabel": "Bad Faith", "relatedDescription": "Sartre's term for self-deception—denying one's freedom and responsibility by identifying with fixed roles or claiming 'I had no choice.' The waiter who plays at being a waiter lives in bad faith.", "relatedCategory": "psychology", "relation": "partOf"},
  {"ideologyLabel": "Existentialism", "category": "existentialism", "relatedLabel": "Angst", "relatedDescription": "Existential anxiety or dread arising from the recognition of one's absolute freedom and the groundlessness of existence. Unlike fear of specific threats, angst is a diffuse awareness of life's fundamental uncertainty.", "relatedCategory": "emotion", "relation": "partOf"},
  {"ideologyLabel": "Existentialism", "category": "existentialism", "relatedLabel": "Being-for-itself", "relatedDescription": "Sartre's term for conscious human existence (être-pour-soi) which is characterized by freedom, negation, and lack of fixed essence. Contrasts with being-in-itself (mere things) which simply is what it is.", "relatedCategory": "ontology", "relation": "partOf"},
  {"ideologyLabel": "Existentialism", "category": "existentialism", "relatedLabel": "Absurdism", "relatedDescription": "The recognition that human search for meaning confronts an inherently meaningless universe. Camus developed this into a full philosophy, but existentialists generally acknowledge the absurd while seeking authentic self-creation.", "relatedCategory": "related", "relation": "supports"},
  {"ideologyLabel": "Existentialism", "category": "existentialism", "relatedLabel": "Phenomenology", "relatedCategory": "methodology", "relation": "influencedBy"},
  {"ideologyLabel": "Phenomenology", "description": "<p>Phenomenology, founded by Edmund Husserl, is the systematic study of structures of experience and consciousness from the first-person perspective. It seeks to investigate phenomena 'as they appear' to consciousness, bracketing assumptions about their external existence.</p><p>The method involves 'epoché' or phenomenological reduction—suspending judgment about the natural world to focus purely on how things are given in experience. Central is the concept of intentionality: consciousness is always consciousness of something; it's inherently directed toward objects.</p><p>Husserl aimed to make philosophy a rigorous science by examining the essential structures of experience. Later phenomenologists like Heidegger, Merleau-Ponty, and Sartre developed phenomenology in existential directions, exploring being-in-the-world, embodiment, and the lived experience.</p>", "category": "methodology", "philosopher": "Edmund Husserl (1859-1938), Martin Heidegger, Maurice Merleau-Ponty", "relatedLabel": "Intentionality", "relatedDescription": "The fundamental property that consciousness is always consciousness of something—it's always directed toward an object. There's no pure consciousness without an object; all awareness is awareness of something.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Phenomenology", "category": "methodology", "relatedLabel": "Epoché", "relatedDescription": "The phenomenological reduction or 'bracketing' where we suspend judgment about the natural world's existence to focus purely on how things appear in consciousness. We set aside questions of external reality to study experience itself.", "relatedCategory": "method", "relation": "partOf"},
  {"ideologyLabel": "Phenomenology", "category": "methodology", "relatedLabel": "Lifeworld", "relatedDescription": "The pre-theoretical, lived world of immediate experience before scientific abstraction. Our everyday world of meaningful objects, social relationships, and practical concerns that forms the foundation for all knowledge.", "relatedCategory": "concept", "relation": "partOf"},
  {"ideologyLabel": "Phenomenology", "category": "methodology", "relatedLabel": "Essence", "relatedDescription": "The invariant, essential structures that make a kind of experience what it is. Through eidetic reduction, phenomenology seeks to identify what must be present for something to be perceived as a tree, a memory, or an emotion.", "relatedCategory": "concept", "relation": "partOf"},
  {"ideologyLabel": "Phenomenology", "category": "methodology", "relatedLabel": "Eidetic Reduction", "relatedDescription": "The method of free imaginative variation to discover essential structures. By varying features of an experience in imagination, we determine which features are essential (can't be removed) and which are accidental.", "relatedCategory": "method", "relation": "partOf"},
  {"ideologyLabel": "Materialism", "description": "<p>Materialism is the metaphysical view that matter is the fundamental substance in nature, and all phenomena, including mental states and consciousness, result from material interactions. It stands in direct opposition to idealism and dualism, asserting that there is no non-material realm.</p><p>Historical materialists include ancient atomists like Democritus, but modern materialism is most associated with Karl Marx's dialectical materialism. Marx argued that material economic conditions shape society, culture, and ideas—not the reverse. Historical materialism views history as driven by class struggle rooted in material economic relations.</p><p>Contemporary materialism often takes the form of physicalism, holding that everything supervenes on or is reducible to the physical. This includes controversial positions like eliminative materialism, which argues that our common-sense understanding of the mind (folk psychology) is fundamentally mistaken and should be eliminated in favor of neuroscience.</p>", "category": "metaphysics", "philosopher": "Karl Marx (1818-1883), Thomas Hobbes, Democritus", "relatedLabel": "Physicalism", "relatedDescription": "The modern form of materialism holding that everything that exists is physical or supervenes on the physical. Mental states, consciousness, and abstract objects ultimately depend on or reduce to physical processes.", "relatedCategory": "metaphysics", "relation": "supports"},
  {"ideologyLabel": "Materialism", "category": "metaphysics", "relatedLabel": "Dialectical Materialism", "relatedDescription": "Marx and Engels' application of Hegelian dialectics to material reality. History progresses through material contradictions and class struggle, with economic forces driving social and ideological change.", "relatedCategory": "social", "relation": "partOf"},
  {"ideologyLabel": "Materialism", "category": "metaphysics", "relatedLabel": "Historical Materialism", "relatedDescription": "Marx's theory that the economic base (modes of production) determines the superstructure (culture, politics, ideology). Material conditions of production shape consciousness, not the reverse.", "relatedCategory": "social", "relation": "partOf"},
  {"ideologyLabel": "Materialism", "category": "metaphysics", "relatedLabel": "Reductionism", "relatedDescription": "The view that complex phenomena can be explained by reducing them to simpler, more fundamental components. Materialists often argue that biology reduces to chemistry, chemistry to physics, and mind to brain.", "relatedCategory": "method", "relation": "supports"},
  {"ideologyLabel": "Materialism", "category": "metaphysics", "relatedLabel": "Eliminativism", "relatedDescription": "Eliminative materialism argues that our common-sense understanding of mind (folk psychology) is a false theory that should be eliminated in favor of neuroscience. Beliefs and desires don't really exist as we conceive them.", "relatedCategory": "philosophy of mind", "relation": "supports"},
  {"ideologyLabel": "Empiricism", "description": "<p>Empiricism is the epistemological position that all knowledge ultimately derives from sensory experience. Empiricists deny the existence of innate ideas or a priori knowledge (except for analytic truths like logic and mathematics), arguing instead that the mind begins as a 'tabula rasa' or blank slate.</p><p>John Locke, George Berkeley, and David Hume form the classical British empiricist tradition. Locke distinguished between simple ideas (directly from sensation) and complex ideas (combinations of simple ideas). Hume pushed empiricism to skeptical conclusions, arguing we can never have certain knowledge of causation, only constant conjunction of experiences.</p><p>Empiricism emphasizes inductive reasoning—generalizing from particular observations—and typically aligns with scientific methodology. However, it faces challenges like the problem of induction (how can past observations justify future predictions?) and explaining how we have knowledge of abstract entities like numbers.</p>", "category": "epistemology", "philosopher": "John Locke (1632-1704), David Hume (1711-1776), George Berkeley", "relatedLabel": "Tabula Rasa", "relatedDescription": "Locke's metaphor of the mind as a 'blank slate' at birth, written on only by experience. We have no innate ideas—all knowledge comes from sensation and reflection on sensory data.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Empiricism", "category": "epistemology", "relatedLabel": "Induction", "relatedDescription": "Reasoning from particular observations to general principles. Empiricists rely on inductive inference to build knowledge, though Hume showed we cannot logically justify induction itself.", "relatedCategory": "method", "relation": "partOf"},
  {"ideologyLabel": "Empiricism", "category": "epistemology", "relatedLabel": "Sense Data", "relatedDescription": "The immediate, private objects of perception—raw sensory impressions like colors, sounds, and textures. Empiricists build knowledge from these basic experiential units.", "relatedCategory": "concept", "relation": "partOf"},
  {"ideologyLabel": "Empiricism", "category": "epistemology", "relatedLabel": "Association", "relatedDescription": "The process by which ideas become connected in the mind through repeated experience. Hume's laws of association (resemblance, contiguity, cause and effect) explain how complex ideas form from simple impressions.", "relatedCategory": "psychology", "relation": "partOf"},
  {"ideologyLabel": "Empiricism", "category": "epistemology", "relatedLabel": "Rationalism", "relatedCategory": "epistemology", "relation": "opposes"},
  {"ideologyLabel": "Rationalism", "description": "<p>Rationalism is the epistemological view that reason is the primary source of knowledge, superior to sensory experience. Rationalists argue that some knowledge is innate or can be known a priori through pure reason, independently of sensory input.</p><p>René Descartes famously used methodological doubt to arrive at 'cogito, ergo sum' (I think, therefore I am) as an indubitable foundation for knowledge. He argued for clear and distinct ideas as the criterion of truth and believed in innate ideas planted by God. Spinoza and Leibniz developed systematic rationalist metaphysics, with Leibniz proposing pre-established harmony and the principle of sufficient reason.</p><p>Rationalism emphasizes deductive reasoning from first principles and typically aligns with mathematical methods. It influenced Kant's synthesis of rationalism and empiricism in his critical philosophy, where he argued that while all knowledge begins with experience, not all knowledge arises from experience.</p>", "category": "epistemology", "philosopher": "René Descartes (1596-1650), Baruch Spinoza (1632-1677), Gottfried Leibniz (1646-1716)", "relatedLabel": "Innate Ideas", "relatedDescription": "Knowledge or concepts we're born with, not acquired from experience. Descartes believed ideas like God, infinity, and mathematical truths are innate—placed in us by God or inherent to reason itself.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Rationalism", "category": "epistemology", "relatedLabel": "Deduction", "relatedDescription": "Logical reasoning from general principles to specific conclusions. Rationalists favor deductive proofs (like mathematical demonstrations) where conclusions necessarily follow from premises, ensuring certain knowledge.", "relatedCategory": "method", "relation": "partOf"},
  {"ideologyLabel": "Rationalism", "category": "epistemology", "relatedLabel": "Clear Ideas", "relatedDescription": "Descartes' criterion of truth: ideas that are clear (present and manifest to an attentive mind) and distinct (sharply separated from all other ideas). Such ideas are self-evidently true and need no external validation.", "relatedCategory": "criterion", "relation": "partOf"},
  {"ideologyLabel": "Rationalism", "category": "epistemology", "relatedLabel": "Cogito", "relatedDescription": "Descartes' foundational principle 'Cogito, ergo sum' (I think, therefore I am). The one truth that survives radical doubt—even if deceived about everything else, the very act of thinking proves the thinker exists.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Rationalism", "category": "epistemology", "relatedLabel": "Platonic Idealism", "relatedCategory": "idealism", "relation": "influencedBy"},
  {"ideologyLabel": "Pragmatism", "description": "<p>Pragmatism is an American philosophical tradition that evaluates the truth and meaning of ideas by their practical consequences and real-world applications. Developed by Charles Sanders Peirce, William James, and John Dewey, it rejects the search for absolute, unchanging truths in favor of what works in practice.</p><p>Peirce's pragmatic maxim states that to determine the meaning of a concept, we should consider what practical effects it might have. James extended this to truth itself: an idea is true if it proves useful and works in leading us to successful action. Dewey applied pragmatism to education and democracy, emphasizing learning through experience and the experimental method.</p><p>Pragmatism embraces fallibilism—all beliefs are potentially revisable in light of new experience. It rejects foundationalism and is generally anti-essentialist, seeing concepts as tools rather than reflections of fixed realities. This approach influenced American legal theory, education, and scientific philosophy.</p>", "category": "epistemology", "philosopher": "Charles Sanders Peirce (1839-1914), William James (1842-1910), John Dewey (1859-1952)", "relatedLabel": "Instrumentalism", "relatedDescription": "The pragmatist view that scientific theories are tools for prediction and problem-solving, not descriptions of ultimate reality. Theories are judged by usefulness, not truth correspondence.", "relatedCategory": "science", "relation": "supports"},
  {"ideologyLabel": "Pragmatism", "category": "epistemology", "relatedLabel": "Pragmatic Maxim", "relatedDescription": "Peirce's principle that a concept's meaning consists in its conceivable practical effects. To clarify an idea, consider what practical consequences its truth would have—that's the idea's entire meaning.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Pragmatism", "category": "epistemology", "relatedLabel": "Fallibilism", "relatedDescription": "The view that no belief is absolutely certain or immune to revision. All knowledge claims are provisional and subject to correction based on future experience. We can be wrong about anything.", "relatedCategory": "epistemology", "relation": "partOf"},
  {"ideologyLabel": "Pragmatism", "category": "epistemology", "relatedLabel": "Anti-foundationalism", "relatedDescription": "Rejection of the idea that knowledge must rest on indubitable foundations. Instead of seeking absolute bedrock, pragmatists see beliefs as a web of mutually supporting claims without ultimate grounding.", "relatedCategory": "epistemology", "relation": "supports"},
  {"ideologyLabel": "Stoicism", "description": "<p>Stoicism is an ancient Hellenistic philosophy founded by Zeno of Citium around 300 BCE, teaching that virtue (understood as living according to reason and nature) is sufficient for happiness. Prominent Stoics include Epictetus, Seneca, and the Roman Emperor Marcus Aurelius.</p><p>Central to Stoicism is the distinction between what is in our control (our judgments, desires, and actions) and what is not (external events, others' opinions, outcomes). The path to tranquility lies in focusing only on what we can control while accepting what we cannot. The Stoics advocated apatheia—freedom from destructive passions through rational understanding.</p><p>Stoics believed in a rational, divine logos permeating the universe, making it fundamentally ordered and purposeful. They promoted cosmopolitanism (we are all citizens of the world), equanimity in the face of hardship, and living in harmony with nature. Stoicism has experienced a modern revival in cognitive-behavioral therapy and practical wisdom.</p>", "category": "ethics", "philosopher": "Marcus Aurelius (121-180 CE), Epictetus (50-135 CE), Seneca (4 BCE-65 CE)", "relatedLabel": "Logos", "relatedDescription": "The divine rational principle that orders and governs the universe in Stoic philosophy. Logos is both cosmic reason and the structure of reality itself—living according to logos means living according to nature and reason.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Stoicism", "category": "ethics", "relatedLabel": "Apatheia", "relatedDescription": "Freedom from destructive passions and emotional disturbances. Not apathy but emotional tranquility achieved through understanding that external events can't truly harm us. We suffer only through false judgments about indifferents.", "relatedCategory": "virtue", "relation": "partOf"},
  {"ideologyLabel": "Stoicism", "category": "ethics", "relatedLabel": "Dichotomy of Control", "relatedDescription": "Epictetus' fundamental distinction between what is in our control (our judgments, desires, actions) and what is not (external events, others' opinions, outcomes). Peace comes from focusing only on what we control.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Stoicism", "category": "ethics", "relatedLabel": "Virtue Ethics", "relatedDescription": "Stoicism is a form of virtue ethics, holding that virtue (wisdom, courage, justice, temperance) is the only true good and sufficient for happiness. External things like health and wealth are 'preferred indifferents.'", "relatedCategory": "ethics", "relation": "supports"},
  {"ideologyLabel": "Stoicism", "category": "ethics", "relatedLabel": "Cosmopolitanism", "relatedDescription": "The Stoic view that we are all citizens of a single world community bound by shared rationality. National boundaries are conventional; we owe moral consideration to all humans as fellow rational beings.", "relatedCategory": "politics", "relation": "partOf"},
  {"ideologyLabel": "Nihilism", "description": "<p>Nihilism is the philosophical viewpoint that life, existence, and the universe lack objective meaning, purpose, or intrinsic value. While often seen as pessimistic, nihilism can be understood as a necessary clearing away of false beliefs to make room for authentic values.</p><p>Friedrich Nietzsche is most associated with nihilism through his proclamation of the 'death of God'—not literally, but as the collapse of traditional religious and metaphysical certainties in modern Europe. Nietzsche saw nihilism as both a diagnosis of modern crisis and something to be overcome through the creation of new values by the Übermensch (overman).</p><p>Nietzsche distinguished between passive nihilism (despair at meaninglessness) and active nihilism (destroying old values to create new ones). His concepts of will to power and eternal recurrence challenge us to affirm life despite its lack of inherent meaning. Nihilism influenced existentialism, postmodernism, and continues to resonate in contemporary discussions of meaning and value.</p>", "category": "existentialism", "philosopher": "Friedrich Nietzsche (1844-1900)", "relatedLabel": "Death of God", "relatedDescription": "Nietzsche's announcement that God is dead—not a literal claim but a diagnosis of modern European culture where traditional religious and metaphysical foundations have lost their authority and credibility.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Nihilism", "category": "existentialism", "relatedLabel": "Eternal Recurrence", "relatedDescription": "Nietzsche's thought experiment: what if you had to live your exact life infinitely many times? This tests whether you can affirm life unconditionally. Only someone who loves their life would welcome eternal recurrence.", "relatedCategory": "cosmology", "relation": "partOf"},
  {"ideologyLabel": "Nihilism", "category": "existentialism", "relatedLabel": "Will to Power", "relatedDescription": "Nietzsche's concept of the fundamental drive in all living things—not mere survival but the drive to grow, expand, and overcome resistance. It's about self-overcoming and creative transformation.", "relatedCategory": "psychology", "relation": "partOf"},
  {"ideologyLabel": "Nihilism", "category": "existentialism", "relatedLabel": "Übermensch", "relatedDescription": "The 'overman' or 'superman'—Nietzsche's ideal of the future human who creates their own values after the death of God. Not a biological superman but someone who overcomes nihilism through self-creation and life-affirmation.", "relatedCategory": "ideal", "relation": "partOf"},
  {"ideologyLabel": "Nihilism", "category": "existentialism", "relatedLabel": "Absurdism", "relatedDescription": "The philosophical recognition that the human search for meaning confronts an indifferent, meaningless universe. Camus developed this into absurdism, exploring how we might live authentically despite the absurd.", "relatedCategory": "related", "relation": "supports"},
  {"ideologyLabel": "Utilitarianism", "description": "<p>Utilitarianism is the ethical theory that the best action is the one that maximizes overall happiness or well-being. Founded by Jeremy Bentham and refined by John Stuart Mill, it's a form of consequentialism—actions are judged solely by their outcomes, not intentions or adherence to rules.</p><p>Bentham proposed the 'greatest happiness principle': actions are right if they promote the greatest happiness for the greatest number. He developed a 'felicific calculus' to measure pleasure and pain. Mill distinguished between higher and lower pleasures, arguing that intellectual and moral pleasures are superior to mere bodily pleasure.</p><p>Utilitarianism faces important challenges: Is it acceptable to sacrifice one innocent person to save many? Can we really calculate consequences? Does it ignore individual rights and justice? Act utilitarianism judges each action by its consequences, while rule utilitarianism evaluates rules by their general utility. Despite criticisms, utilitarianism remains influential in ethics, economics, and public policy.</p>", "category": "ethics", "philosopher": "Jeremy Bentham (1748-1832), John Stuart Mill (1806-1873)", "relatedLabel": "Greatest Happiness", "relatedDescription": "The core utilitarian principle that actions are right insofar as they produce the greatest happiness for the greatest number of people. The good of the many outweighs the good of the few.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Utilitarianism", "category": "ethics", "relatedLabel": "Consequentialism", "relatedDescription": "The broader ethical view that the moral rightness of actions depends solely on their consequences. Utilitarianism is a specific form focusing on happiness/well-being as the relevant consequence.", "relatedCategory": "ethics", "relation": "partOf"},
  {"ideologyLabel": "Utilitarianism", "category": "ethics", "relatedLabel": "Hedonism", "relatedDescription": "The view that pleasure is the only intrinsic good and pain the only intrinsic evil. Bentham's utilitarianism is hedonistic, though Mill added qualitative distinctions between pleasures.", "relatedCategory": "value", "relation": "supports"},
  {"ideologyLabel": "Utilitarianism", "category": "ethics", "relatedLabel": "Felicific Calculus", "relatedDescription": "Bentham's method for calculating the total pleasure and pain produced by an action, considering intensity, duration, certainty, propinquity, fecundity, purity, and extent. A systematic way to measure utility.", "relatedCategory": "method", "relation": "partOf"},
  {"ideologyLabel": "Utilitarianism", "category": "ethics", "relatedLabel": "Act vs Rule", "relatedDescription": "Act utilitarianism evaluates each action directly by its consequences. Rule utilitarianism evaluates rules by their general utility, then follows those rules. The latter avoids calculations in every case.", "relatedCategory": "distinction", "relation": "partOf"},
  {"ideologyLabel": "Deontology", "description": "<p>Deontology is Immanuel Kant's ethical theory that grounds morality in duty and adherence to moral rules, rather than consequences. The name comes from the Greek 'deon' (duty). Actions are judged by whether they follow correct moral principles, not by their outcomes.</p><p>Central to Kantian deontology is the Categorical Imperative, which has several formulations: Act only according to maxims that you could will to become universal laws; treat humanity always as an end in itself, never merely as a means; and act as if you were legislating for a kingdom of ends. These principles respect human dignity, rationality, and autonomy.</p><p>Deontology holds that some actions are intrinsically wrong regardless of consequences—lying, for instance, is always wrong even if it might produce better outcomes. The theory emphasizes moral absolutes, universal duties, and the good will (acting from duty) as the only unconditionally good thing. It contrasts sharply with consequentialist theories like utilitarianism.</p>", "category": "ethics", "philosopher": "Immanuel Kant (1724-1804)", "relatedLabel": "Categorical Imperative", "relatedDescription": "Kant's supreme principle of morality with three formulations: act only on maxims you could will as universal law; treat humanity always as an end, never merely as means; act as legislator in a kingdom of ends.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Deontology", "category": "ethics", "relatedLabel": "Kingdom of Ends", "relatedDescription": "Kant's ideal moral community where all rational beings treat each other as ends-in-themselves, never as mere instruments. Each person has dignity (absolute worth) rather than mere price (relative worth).", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Deontology", "category": "ethics", "relatedLabel": "Autonomy", "relatedDescription": "Self-legislation—the capacity of rational beings to give themselves moral law through reason. Autonomy is the basis of human dignity and why we must be treated as ends-in-ourselves.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Deontology", "category": "ethics", "relatedLabel": "Good Will", "relatedDescription": "The only thing good without qualification—the will to do one's duty from duty, not from inclination or self-interest. Talents, character traits, even happiness are good only when governed by good will.", "relatedCategory": "concept", "relation": "partOf"},
  {"ideologyLabel": "Deontology", "category": "ethics", "relatedLabel": "Transcendental Idealism", "relatedCategory": "idealism", "relation": "influencedBy"},
  {"ideologyLabel": "Deontology", "category": "ethics", "relatedLabel": "Utilitarianism", "relatedCategory": "ethics", "relation": "opposes"},
  {"ideologyLabel": "Virtue Ethics", "description": "<p>Virtue Ethics, rooted in Aristotle's Nicomachean Ethics, focuses on developing good character traits (virtues) rather than following rules or calculating consequences. The goal is eudaimonia—often translated as 'happiness' but better understood as human flourishing or living well.</p><p>Aristotle argued that virtues are character traits that enable us to live well and achieve eudaimonia. They represent the 'golden mean' between vices of excess and deficiency: courage is the mean between cowardice and recklessness. Virtues are developed through habituation and practice, guided by practical wisdom (phronesis)—the ability to discern the right thing to do in particular situations.</p><p>Virtue ethics asks not 'What should I do?' but 'What kind of person should I be?' It emphasizes moral education, role models, and the importance of emotions properly trained. Modern virtue ethicists like Alasdair MacIntyre and Philippa Foot have revived this approach, arguing it better captures moral psychology than rule-based systems.</p>", "category": "ethics", "philosopher": "Aristotle (384-322 BCE), Alasdair MacIntyre, Philippa Foot", "relatedLabel": "Eudaimonia", "relatedDescription": "Human flourishing or living well—the ultimate good in Aristotle's ethics. Not mere pleasure or satisfaction but the excellent activity of the soul in accordance with virtue over a complete life.", "relatedCategory": "goal", "relation": "partOf"},
  {"ideologyLabel": "Virtue Ethics", "category": "ethics", "relatedLabel": "Eudaimonia", "relatedDescription": "Human flourishing or living well—the ultimate good in Aristotle's ethics. Not mere pleasure or satisfaction but the excellent activity of the soul in accordance with virtue over a complete life.", "relatedCategory": "goal", "relation": "partOf"},
  {"ideologyLabel": "Virtue Ethics", "category": "ethics", "relatedLabel": "Golden Mean", "relatedDescription": "Aristotle's doctrine that virtue lies in the mean between excess and deficiency. Courage is the mean between cowardice and recklessness; generosity between stinginess and wastefulness. The mean varies by person and situation.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Virtue Ethics", "category": "ethics", "relatedLabel": "Phronesis", "relatedDescription": "Practical wisdom—the ability to discern the right thing to do in particular situations. It involves understanding the mean, recognizing the importance of emotions, and developing virtues through habituation and practice.", "relatedCategory": "virtue", "relation": "partOf"},
  {"ideologyLabel": "Virtue Ethics", "category": "ethics", "relatedLabel": "Habitus", "relatedDescription": "Aristotle's concept of character traits or virtues developed through habituation and practice. Virtues are not innate but acquired through repeated actions and the development of good habits.", "relatedCategory": "virtue", "relation": "partOf"},
  {"ideologyLabel": "Virtue Ethics", "category": "ethics", "relatedLabel": "Moral Education", "relatedDescription": "The process of developing virtues and good character traits through education, role models, and the proper training of emotions. Virtue ethics emphasizes the importance of moral education for living a good life.", "relatedCategory": "education", "relation": "partOf"},
  {"ideologyLabel": "Skepticism", "description": "<p>Skepticism is the philosophical position that questions the possibility of certainty in knowledge. Ancient skepticism emerged with Pyrrho of Elis and later developed into Academic Skepticism. Skeptics argue that for any claim, equally strong arguments can be made for and against it, leading to suspension of judgment (epoché).</p><p>Pyrrhonian skepticism advocates radical doubt and suspension of judgment on all matters to achieve tranquility (ataraxia). Academic skepticism, associated with Plato's Academy, held that while certain knowledge is impossible, we can have reasonable or probable beliefs. Both traditions challenged dogmatic claims to knowledge.</p><p>Modern skepticism, exemplified by Descartes' methodological doubt and Hume's empirical skepticism, questions causation, induction, and the external world. Contemporary skepticism addresses scientific claims, conspiracy theories, and pseudoscience. While sometimes seen as paralyzing, skepticism serves as a valuable tool for critical thinking and intellectual humility.</p>", "category": "epistemology", "philosopher": "Pyrrho of Elis (c. 360-270 BCE), David Hume (1711-1776), Sextus Empiricus", "relatedLabel": "Pyrrhonian Skepticism", "relatedDescription": "The radical skepticism of Pyrrho of Elis, which holds that we should suspend judgment on all matters, as we can't be certain of anything. This skepticism is not about doubt but about the impossibility of knowledge.", "relatedCategory": "ancient", "relation": "partOf"},
  {"ideologyLabel": "Skepticism", "category": "epistemology", "relatedLabel": "Academic Skepticism", "relatedDescription": "The moderate skepticism of Plato's Academy which held that while certain knowledge is impossible, we can have reasonable or probable beliefs. We act on what seems most likely true without claiming certainty.", "relatedCategory": "ancient", "relation": "partOf"},
  {"ideologyLabel": "Skepticism", "category": "epistemology", "relatedLabel": "Pyrrhonian Skepticism", "relatedDescription": "The radical skepticism of Pyrrho of Elis, which holds that we should suspend judgment on all matters, as we can't be certain of anything. This skepticism is not about doubt but about the impossibility of knowledge.", "relatedCategory": "ancient", "relation": "partOf"},
  {"ideologyLabel": "Skepticism", "category": "epistemology", "relatedLabel": "Cartesian Skepticism", "relatedDescription": "René Descartes' methodological skepticism, which doubts everything that can be doubted to find what is indubitable. He famously doubted his senses, his body, and even his own existence, arriving at 'cogito, ergo sum' as the only certainty.", "relatedCategory": "modern", "relation": "partOf"},
  {"ideologyLabel": "Monism", "description": "<p>Monism is the metaphysical view that reality is fundamentally unified—there is only one kind of substance, property, or principle underlying all existence. This stands in contrast to dualism (two substances) and pluralism (many substances). Monism takes various forms depending on what is considered the ultimate reality.</p><p>Substance monism holds there is only one fundamental substance. This can be material (physicalism—everything reduces to matter/energy) or mental (idealistic monism—everything is mind or consciousness). Neutral monism, proposed by William James and Bertrand Russell, argues that mind and matter are both manifestations of a more fundamental neutral substance.</p><p>Historical monists include Parmenides (all is one unchanging being), Spinoza (God/Nature is the single infinite substance), and Eastern philosophies like Advaita Vedanta (Brahman is the sole reality). Monism offers elegant simplicity but faces challenges explaining the apparent diversity and change in experience.</p>", "category": "metaphysics", "philosopher": "Baruch Spinoza (1632-1677), Parmenides (c. 515-450 BCE)", "relatedLabel": "Substance Monism", "relatedDescription": "The view that there is only one fundamental substance or principle in the universe. This can be material (physicalism) or immaterial (idealism). Monism is often contrasted with dualism, which posits two fundamental substances or realms.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Monism", "category": "metaphysics", "relatedLabel": "Attribute Monism", "relatedDescription": "The view that there is only one fundamental attribute or property in the universe. This can be a physical property (like extension) or a mental property (like consciousness). Attribute monism is often associated with substance monism.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Monism", "category": "metaphysics", "relatedLabel": "Neutral Monism", "relatedDescription": "The view that both mind and matter are manifestations of a more fundamental substance or principle that is neither mental nor physical. This position is often seen as a compromise between idealism and materialism.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Dualism", "description": "<p>Dualism is the metaphysical view that reality consists of two fundamentally different kinds of substances, properties, or principles. The most famous form is mind-body dualism, which holds that mental phenomena are non-physical and distinct from bodily/material phenomena.</p><p>René Descartes is the paradigmatic dualist, arguing that mind (res cogitans—thinking substance) and body (res extensa—extended substance) are completely distinct. The mind is conscious, non-spatial, and indivisible; the body is unconscious, spatial, and divisible. This raises the interaction problem: if mind and body are so different, how can they causally interact? How does a non-physical decision cause a physical action?</p><p>Property dualism offers a more modest position: there's one substance, but mental properties (like consciousness and qualia) are irreducibly different from physical properties and can't be explained by neuroscience alone. Epiphenomenalism suggests mental states are byproducts of physical processes but have no causal power. Dualism faces challenges from neuroscience showing mind-brain correlations, but consciousness remains philosophically puzzling.</p>", "category": "metaphysics", "philosopher": "René Descartes (1596-1650)", "relatedLabel": "Substance Dualism", "relatedDescription": "The view that there are two fundamental substances or realms in the universe: mind (or soul) and matter. This position is often associated with René Descartes, who argued for the separation of mind and body.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Dualism", "category": "metaphysics", "relatedLabel": "Property Dualism", "relatedDescription": "The view that there are two fundamental types of properties in the universe: mental properties (like consciousness) and physical properties (like extension). This position is often seen as a more moderate form of dualism.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Dualism", "category": "metaphysics", "relatedLabel": "Epiphenomenalism", "relatedDescription": "The view that mental states are byproducts of physical processes in the brain but have no causal influence on the physical world. This position is often seen as a form of dualism that avoids the problem of mental causation.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Dualism", "category": "metaphysics", "relatedLabel": "Property Dualism", "relatedDescription": "The view that while there's only one substance, mental properties (qualia, consciousness) are irreducibly different from physical properties. Mental properties supervene on but can't be reduced to physical properties.", "relatedCategory": "variant", "relation": "partOf"},
  {"ideologyLabel": "Logical Positivism", "description": "<p>Logical Positivism, also known as Logical Empiricism, was a philosophical movement that emerged in the 1920s Vienna Circle, seeking to make philosophy scientific by grounding all knowledge in empirical observation and logical analysis. Led by figures like Moritz Schlick, Rudolf Carnap, and A.J. Ayer, positivists aimed to eliminate metaphysics as meaningless speculation.</p><p>The movement's centerpiece was the verification principle: a statement is meaningful only if it can be empirically verified or is analytically true (true by definition). By this standard, metaphysical claims about God, the soul, or ultimate reality are literally nonsensical—not false but meaningless, like 'colorless green ideas sleep furiously.' Only scientific statements (empirically testable) and mathematical/logical truths (tautologies) have cognitive meaning.</p><p>Logical positivists championed the unity of science—reducing all sciences to physics through a common empirical method. They influenced analytic philosophy profoundly but faced fatal problems: the verification principle itself cannot be verified, making it self-refuting. Karl Popper's falsificationism and W.V.O. Quine's critique of the analytic-synthetic distinction further undermined positivism. Though the movement collapsed by the 1960s, it shaped philosophy of science and established empirical rigor as philosophy's standard.</p>", "category": "science", "philosopher": "Moritz Schlick (1882-1936), Rudolf Carnap (1891-1970), A.J. Ayer (1910-1989)", "relatedLabel": "Verification Principle", "relatedDescription": "A statement is meaningful only if empirically verifiable or analytically true. Metaphysical, ethical, and theological claims are literally meaningless because no observation could verify them. This principle famously undermines itself.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Logical Positivism", "category": "science", "relatedLabel": "Protocol Sentences", "relatedDescription": "Basic observational statements that report immediate sensory experience, meant to serve as the foundation for all empirical knowledge. Neurath proposed these as the bedrock of scientific knowledge.", "relatedCategory": "concept", "relation": "partOf"},
  {"ideologyLabel": "Logical Positivism", "category": "science", "relatedLabel": "Unity of Science", "relatedDescription": "The positivist goal of unifying all sciences using the same empirical method and reducing them to physics. All legitimate knowledge would form one coherent system based on observation and logic.", "relatedCategory": "goal", "relation": "partOf"},
  {"ideologyLabel": "Logical Positivism", "category": "science", "relatedLabel": "Analytic-Synthetic", "relatedDescription": "Analytic statements are true by definition (all bachelors are unmarried); synthetic statements require empirical verification (snow is white). Positivists held only these two types of meaningful statements exist. Quine later challenged this distinction.", "relatedCategory": "distinction", "relation": "partOf"},
  {"ideologyLabel": "Structuralism", "description": "<p>Structuralism is a 20th-century intellectual movement that analyzes cultural phenomena as systems of interrelated elements. Founded by Ferdinand de Saussure in linguistics and developed by Claude Lévi-Strauss in anthropology, it argues that meaning arises from the relationships and differences between elements in a system, not from the elements themselves.</p><p>Saussure distinguished between langue (the abstract system of language) and parole (individual speech acts), focusing on synchronic analysis of language as a system at a single point in time. Meaning emerges through binary oppositions and differences—'cat' means what it does because it's not 'bat,' 'mat,' or 'dog.' The signifier (sound/word) is arbitrarily related to the signified (concept).</p><p>Lévi-Strauss applied structuralist methods to myths, kinship systems, and cultures, seeking universal deep structures underlying surface diversity. Structuralism influenced semiotics, literary theory, and psychology (Piaget, Lacan), but faced criticism from poststructuralists who questioned the stability of structures and meaning.</p>", "category": "method", "philosopher": "Ferdinand de Saussure (1857-1913), Claude Lévi-Strauss (1908-2009)", "relatedLabel": "Binary Opposition", "relatedDescription": "Lévi-Strauss's concept that meaning arises through contrast and opposition. Culture organizes experience through binary pairs (nature/culture, raw/cooked, male/female) that structure thought universally.", "relatedCategory": "concept", "relation": "partOf"},
  {"ideologyLabel": "Structuralism", "category": "method", "relatedLabel": "Synchronic Analysis", "relatedDescription": "Saussure's approach of studying a system (like language) at a single point in time, analyzing its structure and internal relations. Contrasts with diachronic analysis which traces historical development.", "relatedCategory": "method", "relation": "partOf"},
  {"ideologyLabel": "Structuralism", "category": "method", "relatedLabel": "Langue vs Parole", "relatedDescription": "Saussure's distinction between langue (the abstract system of language shared by a community) and parole (individual speech acts). Structuralism focuses on langue—the underlying system, not surface performance.", "relatedCategory": "distinction", "relation": "partOf"},
  {"ideologyLabel": "Structuralism", "category": "method", "relatedLabel": "Deep Structure", "relatedDescription": "The universal, underlying patterns that generate surface phenomena. Lévi-Strauss sought deep structures in myths; Chomsky in grammar. These structures are often unconscious but shape all cultural productions.", "relatedCategory": "concept", "relation": "partOf"},
  {"ideologyLabel": "Postmodernism", "description": "<p>Postmodernism is a late 20th-century movement characterized by skepticism toward grand narratives, objective truth, and stable meaning. Key thinkers include Jacques Derrida, Jean-François Lyotard, Michel Foucault, and Jean Baudrillard. It emerged as a critique of Enlightenment rationality and modernist assumptions about progress, reason, and universal values.</p><p>Lyotard defined postmodernism as 'incredulity toward metanarratives'—rejecting overarching explanatory systems like Marxism, Christianity, or scientific progress as inherently oppressive and totalizing. Postmodernism emphasizes plurality, local contexts, and the constructed nature of knowledge and identity. It questions binary oppositions and hierarchies, seeing them as power structures rather than natural categories.</p><p>Derrida's deconstruction shows how texts undermine their own claims to stable meaning. Baudrillard argued we live in a hyperreality of simulations where signs have replaced reality. Foucault analyzed how power operates through discourse and knowledge systems. Critics argue postmodernism is self-contradictory, relativistic, and politically paralyzing.</p>", "category": "contemporary", "philosopher": "Jacques Derrida (1930-2004), Jean-François Lyotard (1924-1998), Michel Foucault (1926-1984)", "relatedLabel": "Deconstruction", "relatedDescription": "Derrida's method of reading texts to expose internal contradictions and unstable oppositions. Shows how texts undermine their own meaning—presence depends on absence, speech on writing, meaning is endlessly deferred.", "relatedCategory": "method", "relation": "partOf"},
  {"ideologyLabel": "Postmodernism", "category": "contemporary", "relatedLabel": "Metanarrative", "relatedDescription": "Lyotard's term for grand narratives that claim to explain everything—Marxism, Christianity, Progress, Enlightenment reason. Postmodernism rejects these totalizing stories as oppressive and illegitimate.", "relatedCategory": "concept", "relation": "critiques"},
  {"ideologyLabel": "Postmodernism", "category": "contemporary", "relatedLabel": "Hyperreality", "relatedDescription": "Baudrillard's concept that in postmodern culture, simulations and signs have replaced reality itself. We live among copies without originals—Disneyland is more 'real' than America, the map precedes the territory.", "relatedCategory": "concept", "relation": "partOf"},
  {"ideologyLabel": "Postmodernism", "category": "contemporary", "relatedLabel": "Différance", "relatedDescription": "Derrida's neologism combining 'difference' and 'deferral.' Meaning arises through difference (signs differ from each other) and is endlessly deferred (never fully present). Written differently than pronounced, it embodies its own concept.", "relatedCategory": "concept", "relation": "partOf"},
  {"ideologyLabel": "Absurdism", "description": "<p>Absurdism is a philosophical perspective developed by Albert Camus that addresses the conflict between humans' desire for meaning and the universe's apparent meaninglessness. Unlike nihilism which denies meaning entirely, or existentialism which creates subjective meaning, absurdism embraces the tension itself.</p><p>Camus argued the absurd arises from the confrontation between our need for rational clarity and the world's irrationality. In The Myth of Sisyphus, he asks whether life is worth living given this absurdity. He rejects both physical suicide (literal death) and philosophical suicide (escaping into religion or abstract philosophy). Instead, he advocates revolt—living passionately while fully acknowledging life's meaninglessness.</p><p>The figure of Sisyphus eternally pushing a boulder uphill represents the human condition. Yet Camus insists 'we must imagine Sisyphus happy'—finding fulfillment in the struggle itself, not in achieving goals. Absurdism influenced theater (Beckett, Ionesco), literature, and continues to resonate with those seeking honest engagement with existential questions.</p>", "category": "existentialism", "philosopher": "Albert Camus (1913-1960)", "relatedLabel": "Sisyphus", "relatedDescription": "Camus's central metaphor: Sisyphus condemned to eternally roll a boulder uphill. Despite the futility, 'we must imagine Sisyphus happy'—finding meaning in the struggle itself, not the outcome.", "relatedCategory": "allegory", "relation": "partOf"},
  {"ideologyLabel": "Absurdism", "category": "existentialism", "relatedLabel": "Philosophical Suicide", "relatedDescription": "Camus's term for escaping the absurd through religious or philosophical systems that promise transcendent meaning. Philosophical suicide avoids confronting absurdity by leap to false hope or abstract systems.", "relatedCategory": "concept", "relation": "critiques"},
  {"ideologyLabel": "Absurdism", "category": "existentialism", "relatedLabel": "Revolt", "relatedDescription": "The proper response to absurdity: neither suicide nor philosophical escape but passionate engagement with life while fully acknowledging meaninglessness. Living intensely and lucidly without appeal to transcendent meaning.", "relatedCategory": "response", "relation": "partOf"},
  {"ideologyLabel": "Taoism", "description": "<p>Taoism (Daoism) is an ancient Chinese philosophy and religion centered on living in harmony with the Tao (Dao)—the fundamental, ineffable principle underlying and unifying the universe. Founded by Laozi (Lao Tzu) in the 6th century BCE with the Tao Te Ching, it emphasizes spontaneity, simplicity, and non-interference with natural processes.</p><p>The core concept is wu wei (non-action or effortless action)—acting in accordance with the natural flow rather than forcing outcomes. Like water that flows around obstacles yet wears away stone, the wise person adapts flexibly and achieves goals without struggle. Taoism values paradox: strength through yielding, knowledge through unknowing, action through non-action.</p><p>Yin and yang represent complementary opposites in dynamic balance—darkness and light, passive and active, feminine and masculine. Taoism influenced Chinese art, medicine, martial arts, and governance. Along with Confucianism and Buddhism, it forms one of the 'Three Teachings' shaping East Asian thought. Philosophical Taoism focuses on mystical unity with the Tao, while religious Taoism incorporates deities, rituals, and immortality practices.</p>", "category": "eastern", "philosopher": "Laozi (Lao Tzu) (6th century BCE), Zhuangzi (4th century BCE)", "relatedLabel": "Wu Wei", "relatedDescription": "Non-action or effortless action—the Taoist principle of acting in harmony with the natural flow of the Tao. Not passivity but action without force, struggle, or interference with nature's spontaneous processes.", "relatedCategory": "principle", "relation": "partOf"},
  {"ideologyLabel": "Taoism", "category": "eastern", "relatedLabel": "Yin Yang", "relatedDescription": "Complementary opposites in dynamic balance: darkness/light, passive/active, feminine/masculine. Neither is superior; both are necessary and contain the seed of the other. Reality emerges from their continuous interplay.", "relatedCategory": "cosmology", "relation": "partOf"},
  {"ideologyLabel": "Taoism", "category": "eastern", "relatedLabel": "Ziran", "relatedDescription": "Naturalness or spontaneity—things as they are in their natural state, free from human artifice. The Taoist ideal is to return to ziran, living simply and authentically without social conventions distorting our nature.", "relatedCategory": "concept", "relation": "partOf"},
  {"ideologyLabel": "Taoism", "category": "eastern", "relatedLabel": "Qi", "relatedDescription": "Vital energy or life force that flows through all things. Taoist practices like qigong and tai chi cultivate and balance qi for health and harmony with the Tao.", "relatedCategory": "cosmology", "relation": "partOf"},
  {"ideologyLabel": "Buddhism", "description": "<p>Buddhism is a philosophical and spiritual tradition founded by Gautama Buddha (c. 563-483 BCE) in ancient India. It centers on understanding and ending suffering (dukkha) through ethical living, meditation, and wisdom. Unlike theistic religions, Buddhism doesn't require belief in a creator god but focuses on direct experience and personal transformation.</p><p>The Four Noble Truths form Buddhism's foundation: (1) Life involves suffering; (2) Suffering arises from craving and attachment; (3) Suffering can cease; (4) The path to ending suffering is the Eightfold Path. The Eightfold Path encompasses right understanding, intention, speech, action, livelihood, effort, mindfulness, and concentration—a comprehensive ethical and meditative practice.</p><p>Central to Buddhism is anatta (no-self)—there is no permanent, unchanging soul or essence. What we call 'self' is a constantly changing process of five aggregates. Everything arises through dependent origination—nothing exists independently. The goal is nirvana—liberation from the cycle of rebirth and suffering. Buddhism has evolved into various traditions (Theravada, Mahayana, Vajrayana) across Asia and now globally.</p>", "category": "eastern", "philosopher": "Gautama Buddha (c. 563-483 BCE)", "relatedLabel": "Four Noble Truths", "relatedDescription": "Buddhism's core teaching: (1) Life involves suffering (dukkha); (2) Suffering arises from craving/attachment; (3) Suffering can end; (4) The Eightfold Path leads to suffering's end. Foundation of Buddhist philosophy.", "relatedCategory": "doctrine", "relation": "partOf"},
  {"ideologyLabel": "Buddhism", "category": "eastern", "relatedLabel": "Eightfold Path", "relatedDescription": "The path to ending suffering: right view, intention, speech, action, livelihood, effort, mindfulness, concentration. A comprehensive practice integrating ethics, meditation, and wisdom to achieve liberation.", "relatedCategory": "practice", "relation": "partOf"},
  {"ideologyLabel": "Buddhism", "category": "eastern", "relatedLabel": "Anatta", "relatedDescription": "No-self or non-self—the Buddhist teaching that there is no permanent, unchanging soul or essence. The 'self' is a constantly changing process of five aggregates, not a fixed entity. This contradicts Hindu atman.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Buddhism", "category": "eastern", "relatedLabel": "Nirvana", "relatedDescription": "The ultimate goal—liberation from suffering and the cycle of rebirth (samsara). Not annihilation but the cessation of craving, ignorance, and delusion. A state beyond description achieved through enlightenment.", "relatedCategory": "goal", "relation": "partOf"},
  {"ideologyLabel": "Buddhism", "category": "eastern", "relatedLabel": "Dependent Origination", "relatedDescription": "Pratityasamutpada—the principle that all phenomena arise in dependence on conditions. Nothing exists independently or permanently. Understanding this interdependence is key to wisdom and liberation.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Confucianism", "description": "<p>Confucianism is a Chinese ethical and philosophical system developed by Confucius (551-479 BCE) and his followers, particularly Mencius. Rather than a religion, it's a comprehensive social philosophy emphasizing moral cultivation, proper relationships, and virtuous governance. Confucianism has profoundly shaped East Asian cultures for over two millennia.</p><p>Central to Confucianism is ren (benevolence or humaneness)—the supreme virtue of compassionate concern for others. It's cultivated through li (ritual propriety)—following traditional ceremonies and social norms that structure relationships harmoniously. The Five Relationships (ruler-subject, father-son, husband-wife, elder-younger, friend-friend) define society, with filial piety (xiao) paramount.</p><p>The Confucian ideal is the junzi (gentleman or superior person)—one who cultivates virtue through study, ritual, and self-reflection. Confucius emphasized the 'rectification of names'—ensuring roles match reality and people fulfill their designated duties. Education, moral example from leaders, and harmonious social order are crucial. Confucianism competed with Daoism and Buddhism but became China's official ideology, influencing law, education, and family structure throughout East Asia.</p>", "category": "eastern", "philosopher": "Confucius (551-479 BCE), Mencius (372-289 BCE)", "relatedLabel": "Ren", "relatedDescription": "Benevolence or humaneness—the supreme Confucian virtue. Compassionate concern for others and the capacity to extend kindness universally. Cultivated through proper relationships and ritual practice.", "relatedCategory": "virtue", "relation": "partOf"},
  {"ideologyLabel": "Confucianism", "category": "eastern", "relatedLabel": "Li", "relatedDescription": "Ritual propriety or proper conduct—the forms, ceremonies, and etiquette that structure social relationships harmoniously. Through practicing li, one cultivates ren and maintains social order.", "relatedCategory": "virtue", "relation": "partOf"},
  {"ideologyLabel": "Confucianism", "category": "eastern", "relatedLabel": "Filial Piety", "relatedDescription": "Xiao—respect and devotion to parents and ancestors. The fundamental virtue in Confucianism from which all other virtues flow. Extends to loyalty to rulers and reverence for tradition.", "relatedCategory": "virtue", "relation": "partOf"},
  {"ideologyLabel": "Confucianism", "category": "eastern", "relatedLabel": "Rectification of Names", "relatedDescription": "Zhengming—ensuring that roles and titles correspond to reality. A ruler should truly rule justly; a father should truly be fatherly. When names are correct, social order follows naturally.", "relatedCategory": "social", "relation": "partOf"},
  {"ideologyLabel": "Existentialism", "category": "existentialism", "relatedLabel": "Nihilism", "relatedCategory": "existentialism", "relation": "influencedBy"},
  {"ideologyLabel": "Pragmatism", "category": "epistemology", "relatedLabel": "Empiricism", "relatedCategory": "epistemology", "relation": "influencedBy"},
  {"ideologyLabel": "Phenomenology", "category": "methodology", "relatedLabel": "Transcendental Idealism", "relatedCategory": "idealism", "relation": "influencedBy"},
  {"ideologyLabel": "Virtue Ethics", "category": "ethics", "relatedLabel": "Stoicism", "relatedCategory": "ethics", "relation": "influencedBy"},
  {"ideologyLabel": "Postmodernism", "category": "contemporary", "relatedLabel": "Phenomenology", "relatedCategory": "methodology", "relation": "influencedBy"},
  {"ideologyLabel": "Absurdism", "category": "existentialism", "relatedLabel": "Phenomenology", "relatedCategory": "methodology", "relation": "influencedBy"},
  {"ideologyLabel": "Logical Positivism", "category": "science", "relatedLabel": "Empiricism", "relatedCategory": "epistemology", "relation": "influencedBy"},
  {"ideologyLabel": "Dualism", "category": "metaphysics", "relatedLabel": "Rationalism", "relatedCategory": "epistemology", "relation": "supports"},
  {"ideologyLabel": "Buddhism", "category": "eastern", "relatedLabel": "Phenomenology", "relatedCategory": "methodology", "relation": "supports"},
  {"ideologyLabel": "Taoism", "category": "eastern", "relatedLabel": "Stoicism", "relatedCategory": "ethics", "relation": "supports"},
  {"ideologyLabel": "Stoicism", "category": "ethics", "relatedLabel": "Platonic Idealism", "relatedCategory": "idealism", "relation": "influencedBy"},
  {"ideologyLabel": "Materialism", "category": "metaphysics", "relatedLabel": "Empiricism", "relatedCategory": "epistemology", "relation": "supports"},
  {"ideologyLabel": "Pantheism", "description": "<p>Pantheism is the view that God and the universe are identical—everything is divine, and the divine is everything. The term comes from Greek 'pan' (all) and 'theos' (God). Pantheism denies any transcendent God separate from nature; instead, God is immanent in all things, and all things are in God.</p><p>Baruch Spinoza's philosophy is the classic Western pantheism: there is only one infinite substance, which he calls both God and Nature (Deus sive Natura). Everything that exists is a mode or expression of this single divine substance. The distinction between Creator and creation collapses—nature is not God's artwork but God's very being.</p><p>Pantheism appears in various forms across traditions: Stoic logos permeating the cosmos, Hindu Brahman as ultimate reality, and aspects of Taoism seeing the Tao in all things. It offers a sense of unity with nature and the divine but faces challenges: if everything is God, is the term meaningful? Can pantheism accommodate traditional religious concepts like worship, prayer, or moral evil?</p>", "category": "metaphysics", "philosopher": "Baruch Spinoza (1632-1677)", "relatedLabel": "Immanence", "relatedDescription": "The divine as present within all things rather than transcendent or separate from the world. In pantheism, God is wholly immanent—not 'up there' but 'right here' in every aspect of nature.", "relatedCategory": "concept", "relation": "partOf"},
  {"ideologyLabel": "Pantheism", "category": "metaphysics", "relatedLabel": "Natura Naturans", "relatedDescription": "Spinoza's term for 'nature naturing'—God/Nature as active, creative, generative power. The infinite productive capacity that generates all finite things.", "relatedCategory": "concept", "relation": "partOf"},
  {"ideologyLabel": "Pantheism", "category": "metaphysics", "relatedLabel": "Natura Naturata", "relatedDescription": "Spinoza's term for 'nature natured'—the totality of finite things and modes that result from God/Nature's creative power. Everything that exists as effects or expressions of the divine substance.", "relatedCategory": "concept", "relation": "partOf"},
  {"ideologyLabel": "Pantheism", "category": "metaphysics", "relatedLabel": "Monism", "relatedCategory": "metaphysics", "relation": "supports"},
  {"ideologyLabel": "Skepticism", "category": "epistemology", "relatedLabel": "Phenomenology", "relatedCategory": "methodology", "relation": "influencedBy"},
  {"ideologyLabel": "Structuralism", "category": "method", "relatedLabel": "Rationalism", "relatedCategory": "epistemology", "relation": "influencedBy"},
  {"ideologyLabel": "Confucianism", "category": "eastern", "relatedLabel": "Virtue Ethics", "relatedCategory": "ethics", "relation": "supports"},
  {"ideologyLabel": "Buddhism", "category": "eastern", "relatedLabel": "Stoicism", "relatedCategory": "ethics", "relation": "supports"},
  {"ideologyLabel": "Pragmatism", "category": "epistemology", "relatedLabel": "Utilitarianism", "relatedCategory": "ethics", "relation": "supports"},
  {"ideologyLabel": "Deontology", "category": "ethics", "relatedLabel": "Rationalism", "relatedCategory": "epistemology", "relation": "influencedBy"},
  {"ideologyLabel": "Logical Positivism", "category": "science", "relatedLabel": "Pragmatism", "relatedCategory": "epistemology", "relation": "critiques"},
  {"ideologyLabel": "Postmodernism", "category": "contemporary", "relatedLabel": "Absolute Idealism", "relatedCategory": "idealism", "relation": "critiques"},
  {"ideologyLabel": "Existentialism", "category": "existentialism", "relatedLabel": "Rationalism", "relatedCategory": "epistemology", "relation": "critiques"},
  {"ideologyLabel": "Empiricism", "category": "epistemology", "relatedLabel": "Platonic Idealism", "relatedCategory": "idealism", "relation": "opposes"},
  {"ideologyLabel": "Materialism", "category": "metaphysics", "relatedLabel": "Platonic Idealism", "relatedCategory": "idealism", "relation": "opposes"},
  {"ideologyLabel": "Materialism", "category": "metaphysics", "relatedLabel": "Subjective Idealism", "relatedCategory": "idealism", "relation": "opposes"},
  {"ideologyLabel": "Materialism", "category": "metaphysics", "relatedLabel": "Absolute Idealism", "relatedCategory": "idealism", "relation": "opposes"},
  {"ideologyLabel": "Nihilism", "category": "existentialism", "relatedLabel": "Virtue Ethics", "relatedCategory": "ethics", "relation": "opposes"},
  {"ideologyLabel": "Skepticism", "category": "epistemology", "relatedLabel": "Absolute Idealism", "relatedCategory": "idealism", "relation": "critiques"},
  {"ideologyLabel": "Taoism", "category": "eastern", "relatedLabel": "Absolute Idealism", "relatedCategory": "idealism", "relation": "supports"},
  {"ideologyLabel": "Buddhism", "category": "eastern", "relatedLabel": "Platonic Idealism", "relatedCategory": "idealism", "relation": "critiques"},
  {"ideologyLabel": "Buddhism", "category": "eastern", "relatedLabel": "Materialism", "relatedCategory": "metaphysics", "relation": "critiques"},
  {"ideologyLabel": "Confucianism", "category": "eastern", "relatedLabel": "Deontology", "relatedCategory": "ethics", "relation": "supports"},
  {"ideologyLabel": "Utilitarianism", "category": "ethics", "relatedLabel": "Pragmatism", "relatedCategory": "epistemology", "relation": "influencedBy"},
  {"ideologyLabel": "Virtue Ethics", "category": "ethics", "relatedLabel": "Platonic Idealism", "relatedCategory": "idealism", "relation": "influencedBy"},
  {"ideologyLabel": "Monism", "category": "metaphysics", "relatedLabel": "Platonic Idealism", "relatedCategory": "idealism", "relation": "supports"},
  {"ideologyLabel": "Structuralism", "category": "method", "relatedLabel": "Platonic Idealism", "relatedCategory": "idealism", "relation": "influencedBy"},
  {"ideologyLabel": "Postmodernism", "category": "contemporary", "relatedLabel": "Platonic Idealism", "relatedCategory": "idealism", "relation": "critiques"},
  {"ideologyLabel": "Absurdism", "category": "existentialism", "relatedLabel": "Stoicism", "relatedCategory": "ethics", "relation": "opposes"},
  {"ideologyLabel": "Phenomenology", "category": "methodology", "relatedLabel": "Empiricism", "relatedCategory": "epistemology", "relation": "critiques"},
  {"ideologyLabel": "Rationalism", "category": "epistemology", "relatedLabel": "Transcendental Idealism", "relatedCategory": "idealism", "relation": "influencedBy"},
  {"ideologyLabel": "Pragmatism", "category": "epistemology", "relatedLabel": "Transcendental Idealism", "relatedCategory": "idealism", "relation": "critiques"},
  {"ideologyLabel": "Logical Positivism", "category": "science", "relatedLabel": "Transcendental Idealism", "relatedCategory": "idealism", "relation": "critiques"},
  {"ideologyLabel": "Pantheism", "category": "metaphysics", "relatedLabel": "Taoism", "relatedCategory": "eastern", "relation": "supports"},
  {"ideologyLabel": "Dualism", "category": "metaphysics", "relatedLabel": "Platonic Idealism", "relatedCategory": "idealism", "relation": "influencedBy"},
  {"ideologyLabel": "Skepticism", "category": "epistemology", "relatedLabel": "Buddhism", "relatedCategory": "eastern", "relation": "supports"},
  {"ideologyLabel": "Materialism", "category": "metaphysics", "relatedLabel": "Dialectic", "relatedDescription": "Marx adapted Hegel's dialectical method to material reality. Historical progress occurs through contradictions in economic systems—thesis (feudalism), antithesis (capitalism), synthesis (socialism). Material forces drive dialectical change.", "relatedCategory": "method", "relation": "partOf"},
  {"ideologyLabel": "Existentialism", "category": "existentialism", "relatedLabel": "Essence", "relatedDescription": "Existentialists reverse the traditional priority: 'existence precedes essence.' We exist first without predetermined nature, then create our essence through choices and actions. We are what we make of ourselves.", "relatedCategory": "concept", "relation": "critiques"},
  {"ideologyLabel": "Platonic Idealism", "category": "idealism", "relatedLabel": "Essence", "relatedDescription": "The Form of a thing—its essential, unchanging nature. A circle's essence is circularity itself, independent of any drawn circles. Essences are eternal, perfect, and more real than physical instances.", "relatedCategory": "metaphysics", "relation": "partOf"},
  {"ideologyLabel": "Stoicism", "category": "ethics", "relatedLabel": "Virtue", "relatedDescription": "The Stoics identified virtue with living according to nature and reason. The four cardinal virtues are wisdom, courage, justice, and temperance. Virtue alone is sufficient for happiness (eudaimonia).", "relatedCategory": "ethics", "relation": "partOf"},
  {"ideologyLabel": "Confucianism", "category": "eastern", "relatedLabel": "Virtue", "relatedDescription": "Confucian virtues center on ren (benevolence), yi (righteousness), li (propriety), zhi (wisdom), and xin (trustworthiness). Virtue is cultivated through education, ritual, and proper relationships.", "relatedCategory": "ethics", "relation": "partOf"},
  {"ideologyLabel": "Rationalism", "category": "epistemology", "relatedLabel": "A Priori", "relatedDescription": "Knowledge that can be known independently of experience—mathematical truths, logical principles, and metaphysical necessities. Rationalists argue reason alone can access fundamental truths about reality.", "relatedCategory": "epistemology", "relation": "partOf"},
  {"ideologyLabel": "Transcendental Idealism", "category": "idealism", "relatedLabel": "A Priori", "relatedDescription": "Kant distinguished a priori knowledge (independent of experience) from a posteriori (empirical). Space, time, and categories are a priori structures the mind brings to experience, making knowledge possible.", "relatedCategory": "epistemology", "relation": "partOf"},
  {"ideologyLabel": "Existentialism", "category": "existentialism", "relatedLabel": "Stoicism", "relatedCategory": "ethics", "relation": "opposes"},
  {"ideologyLabel": "Existentialism", "category": "existentialism", "relatedLabel": "Subjective Idealism", "relatedCategory": "idealism", "relation": "influencedBy"},
  {"ideologyLabel": "Utilitarianism", "category": "ethics", "relatedLabel": "Empiricism", "relatedCategory": "epistemology", "relation": "influencedBy"},
  {"ideologyLabel": "Postmodernism", "category": "contemporary", "relatedLabel": "Structuralism", "relatedCategory": "method", "relation": "critiques"},
  {"ideologyLabel": "Postmodernism", "category": "contemporary", "relatedLabel": "Rationalism", "relatedCategory": "epistemology", "relation": "critiques"},
  {"ideologyLabel": "Postmodernism", "category": "contemporary", "relatedLabel": "Materialism", "relatedCategory": "metaphysics", "relation": "critiques"},
  {"ideologyLabel": "Buddhism", "category": "eastern", "relatedLabel": "Skepticism", "relatedCategory": "epistemology", "relation": "supports"},
  {"ideologyLabel": "Monism", "category": "metaphysics", "relatedLabel": "Pantheism", "relatedCategory": "metaphysics", "relation": "supports"},
  {"ideologyLabel": "Monism", "category": "metaphysics", "relatedLabel": "Buddhism", "relatedCategory": "eastern", "relation": "supports"},
  {"ideologyLabel": "Skepticism", "category": "epistemology", "relatedLabel": "Empiricism", "relatedCategory": "epistemology", "relation": "influencedBy"},
  {"ideologyLabel": "Deontology", "category": "ethics", "relatedLabel": "Utilitarianism", "relatedCategory": "ethics", "relation": "critiques"},
  {"ideologyLabel": "Absurdism", "category": "existentialism", "relatedLabel": "Nihilism", "relatedCategory": "existentialism", "relation": "influencedBy"},
  {"ideologyLabel": "Absurdism", "category": "existentialism", "relatedLabel": "Existentialism", "relatedCategory": "existentialism", "relation": "supports"},
  {"ideologyLabel": "Dualism", "category": "metaphysics", "relatedLabel": "Monism", "relatedCategory": "metaphysics", "relation": "opposes"},
  {"ideologyLabel": "Dualism", "category": "metaphysics", "relatedLabel": "Materialism", "relatedCategory": "metaphysics", "relation": "opposes"},
  {"ideologyLabel": "Nihilism", "category": "existentialism", "relatedLabel": "Stoicism", "relatedCategory": "ethics", "relation": "opposes"},
  {"ideologyLabel": "Taoism", "category": "eastern", "relatedLabel": "Pragmatism", "relatedCategory": "epistemology", "relation": "supports"},
  {"ideologyLabel": "Confucianism", "category": "eastern", "relatedLabel": "Virtue Ethics", "relatedCategory": "ethics", "relation": "supports"},
  {"ideologyLabel": "Structuralism", "category": "method", "relatedLabel": "Rationalism", "relatedCategory": "epistemology", "relation": "influencedBy"}
]
